Console.Clear();

// Задача 19
// Напишите программу, которая принимает на вход 
// пятизначное число и проверяет, является ли оно палиндромом.

// 14212 -> нет
// 12821 -> да
// 23432 -> да

// Console.Write("Введите число:");
// int n = Convert.ToInt32(Console.ReadLine());

// WriteSquareTable(n);

// void WriteSquareTable(int n)
// {
//     int i = 1;

//     while (i <= n)
//     {
//         Console.WriteLine($"| {i} | {i * i,2} |");
//         i++;
//     }
// }